Public Attributes | List of all members
API_IFCProperty Struct Reference
Element Manager API
IFC property container structure. More...
#include <APIdefs_Properties.h>
 Public Attributes
API_IFCPropertyHead  | head
Property header information.
API_IFCPropertySingleValue  | singleValue
IfcPropertySingleValue values.
API_IFCPropertyBoundedValue  | boundedValue
IfcPropertyBoundedValue values.
API_IFCPropertyListValue  | listValue
IfcPropertyListValue values.
API_IFCPropertyEnumeratedValue  | enumeratedValue
IfcPropertyEnumeratedValue values.
API_IFCPropertyTableValue  | tableValue
IfcPropertyTableValue values.
Detailed Description
IFC property container structure.
Remarks
This structure contains the data of an Ifc(Simple)Property. head contains common information for each type. head.propertyType determines which value member contains value data.
Member Data Documentation
◆ boundedValue
 API_IFCProperty::boundedValue
IfcPropertyBoundedValue values.
◆ enumeratedValue
 API_IFCProperty::enumeratedValue
IfcPropertyEnumeratedValue values.
◆ head
 API_IFCProperty::head
Property header information.
◆ listValue
 API_IFCProperty::listValue
IfcPropertyListValue values.
◆ singleValue
 API_IFCProperty::singleValue
IfcPropertySingleValue values.
◆ tableValue
 API_IFCProperty::tableValue
IfcPropertyTableValue values.